{
  "title": "Brownies Two Ways",
  "subtitle": "One pan classic, one pan with mix-ins — makes two 8x8-inch pans",
  "sections": [
    {
      "title": "You will need",
      "list": [
        "All-purpose flour – 1 1/2 c (180g)",
        "Dutch-process cocoa – 1 1/4 c (106g)",
        "Baking powder – 1 tsp",
        "Salt – 1/2 tsp",
        "Granulated sugar – 2 1/4 c (447g)",
        "Water – 1/2 c (113g)",
        "Large eggs – 5",
        "Salted butter – 2 sticks (226g)",
        "Vanilla extract – 1 Tbsp (14g)",
        "Chopped walnuts or pecans (optional) – up to 2 c total with chips",
        "Chocolate chips (optional) – up to 2 c total with nuts",
        "8x8 inch pan – 2"
      ]
    },
    {
      "title": "Mise en Place",
      "list": [
        "Large Bowl: granulated sugar – 2 1/4 cups (447g)",
        "Small Bowl:",
        "- Dutch-process cocoa – 1 1/4 cups (106g)",
        "- Baking powder – 1 teaspoon",
        "- Salt – 1/2 tsp",
        "Medium Bowl:",
        "- All-purpose flour – 1 1/2 cups (180g)",
        "- Optional Mix-ins: 2 cups total of:",
        "  - Chopped walnuts or pecans",
        "  - Chocolate chips"
      ]
    },
    {
      "title": "Instructions",
      "list": [
        "If using nuts as mix-ins, toast them first.",
        "Preheat oven to 350°F (175°C). Line two 8x8-inch pans with parchment and grease lightly.",
        "Melt the butter and let it cool slightly.",
        "In a large bowl, combine the sugar and melted butter. Stir until smooth and glossy.",
        "Whisk together the cocoa, baking powder, and salt in the small bowl. Stir this mixture into the sugar-butter mixture along with the vanilla extract.",
        "Beat in the eggs one at a time, mixing well after each addition. You're done using the beaters after this step.",
        "Add 1/2 C water and scrape the sides of the bolw.  Stir until smooth and fully combined.",
        "Add the flour and stir until just combined.",
        "Divide the batter evenly into two bowls (approximately 950–975g each).",
        "Toss the optional mix-ins in a spoonful of flour. Stir them into only one of the two bowls of batter.",
        "Spoon each batter into its own prepared pan and smooth the tops.",
        "Bake both pans for 25–30 minutes, rotating halfway through. A toothpick inserted in the center should come out with moist crumbs.",
        "Cool in the pans for 15 minutes, then lift out using parchment and cool completely on a rack.",
        "Glaze or frost if desired. Store airtight, or freeze one pan for later."
      ]
    }
  ]
}
