{
    "title": "Chicken Peanut Stew",
    "subtitle": "Makes 2 servings.  Great over rice.",
    "sections": [
        {
            "title": "You will need", "list": [
                "Red Bell Pepper -1",
                "Onion - 1",
                "Plum Tomato - 3",
                "Baby Spinach - 1/2 pound",
                "Lime - 2",
                "Ginger Paste",
                "Garlic Paste",
                "Sesame Oil",
                "Chili Powder",
                "Brown Sugar or Honey",
                "Peanut Butter Powder",
                "Chicken Thighs - 2 ",
                "Broth or Stock - 2 Cups"
            ]
        },
        {
            "title": "Marinate the chicken", "list": [
                "Wash, dry, and zest the limes into your marinating vessel and cut them in half.",
                "Combine the 2 TBSP oil, 1 tsp sesame oil, the zest of the whole lime and juice of half, ginger, garlic, 2 tsp brown sugar or honey, 1 tsp salt, lots of black pepper,½ tsp chili powder",
                "Slice the chicken into bite-size pieces.  Marinate the chicken at least 15 minutes"
            ]
        },
        {
            "title": "Prep", "list": [
                "Wash and dry produce",
                "Dice tomatoes",
                "Slice onion and pepper and cut into bite-size pieces",
                "Measure 2 C stock",
                "Measure 4 TBSP or ¼ Cup peanut butter powder",
                "Measure ½ # spinach"
            ]
        },
        {
            "title": "Cook", "list": [
                "                Heat a pan over medium-high heat and add the chicken mixture. Let it cook undisturbed for two minutes, then turn the mixture over and cook for another two minutes to let it brown. Stir, then cook for another five minutes while stirring occasionally.",
                "Set the chicken aside and cook the onions and peppers until soft/translucent.  Up to 7 min.",
                "If you're going to add more garlic, now's the time.  Let it cook until fragrant.",
                "Add the broth, powdered peanut butter, chicken, and tomatoes. Bring it to a boil, reduce it to a simmer, and cook for 20-25 minutes uncovered.  ",
                "Taste and adjust seasonings (salt, pepper, chili powder, brown sugar) as needed.",
                "Stir in the spinach, and turn off the heat as soon as it wilts.",
                "Add fresh lime juice"
            ]
        }
    ]
}


